---
kind: property
id: P:Autodesk.Revit.DB.SymbolicCurve.IsDrawnInForeground
source: html/94faa7b4-a4e1-eda0-65bb-9fc2b9c60563.htm
---
# Autodesk.Revit.DB.SymbolicCurve.IsDrawnInForeground Property

Indicates if this curve will be drawn in the foreground of the family instance.

## Syntax (C#)
```csharp
public bool IsDrawnInForeground { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Thrown when regeneration failed.
Thrown when the value for this property cannot be changed.